{
  "auto_mapping": null,
  "base_model_name_or_path": "bert-base-uncased",
  "exclude_modules": null,
  "fan_in_fan_out": false,
  "feedforward_modules": [
    "output.dense"
  ],
  "inference_mode": true,
  "init_ia3_weights": true,
  "modules_to_save": [
    "classifier",
    "score"
  ],
  "peft_type": "IA3",
  "revision": null,
  "target_modules": [
    "query",
    "value"
  ],
  "task_type": "SEQ_CLS"
}